Versions/TyT/PROGS/XML-DAE/SUST/08042019150424-01902441201900003379S-XMLREQUEST.XML

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><SOAP-ENV:Header><ns0:Header xmlns:ns0="http://soapinterop.org/xsd"><ns0:DclrCd>01902441</ns0:DclrCd><ns0:DclrRuc>0991370226001</ns0:DclrRuc><ns0:DclrSeCd>01</ns0:DclrSeCd><ns0:DclrSeId>GASDFE</ns0:DclrSeId><ns0:DocPrcsType>O</ns0:DocPrcsType><ns0:RcsdEdocAfrCd>001</ns0:RcsdEdocAfrCd><ns0:RcsdEdocTypeCd>003</ns0:RcsdEdocTypeCd><ns0:SmtNo>01902441201900003379S</ns0:SmtNo><ns0:UserId>PTORRES</ns0:UserId></ns0:Header></SOAP-ENV:Header><SOAP-ENV:Body><tns:sendImportDespachoRADI xmlns:tns="http://webservice.icl.dclt.ecuapass.aduana.gob.ec/"><arg0>&lt;DocumentMetadata xsi:schemaLocation="urn:wco:datamodel:EC:RADI:1:0:0 EC_RADI_0p1.02.xsd" xmlns="urn:wco:datamodel:EC:RADI:1:0:0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"&gt;
&lt;WCODataModelVersion&gt;3.0&lt;/WCODataModelVersion&gt;
&lt;WCODocumentName&gt;RADI&lt;/WCODocumentName&gt;
&lt;CountryCode&gt;EC&lt;/CountryCode&gt;
&lt;AgencyName&gt;SENAE&lt;/AgencyName&gt;
&lt;AgencyAssignedCountrySubEntityID&gt;SENAE&lt;/AgencyAssignedCountrySubEntityID&gt;
&lt;AgencyAssignedCustomizedDocumentName&gt;RADI&lt;/AgencyAssignedCustomizedDocumentName&gt;
&lt;AgencyAssignedCustomizedDocumentVersion&gt;1.0.0&lt;/AgencyAssignedCustomizedDocumentVersion&gt;
&lt;Declaration&gt;
&lt;TypeCode&gt;003&lt;/TypeCode&gt;
&lt;IssueDateTime&gt;2019-04-08T15:04:24Z&lt;/IssueDateTime&gt;&lt;ID&gt;01902441201900003379S&lt;/ID&gt;&lt;DeclarationOfficeID&gt;055&lt;/DeclarationOfficeID&gt;&lt;VersionID&gt;1.1&lt;/VersionID&gt;&lt;GoodsItemQuantity&gt;1&lt;/GoodsItemQuantity&gt;&lt;CorrectionTypeCode&gt;2&lt;/CorrectionTypeCode&gt;&lt;DegreeNumber&gt;1&lt;/DegreeNumber&gt;&lt;Agent&gt;&lt;ID&gt;01902441&lt;/ID&gt;&lt;/Agent&gt;&lt;Amendment&gt;&lt;ChangeReasonCode&gt;A&lt;/ChangeReasonCode&gt;&lt;AmendmentChangeReason&gt;DAI SUSTITUTIVA&lt;/AmendmentChangeReason&gt;&lt;AdditionalInformation&gt;&lt;ResponsibilityCode&gt;01&lt;/ResponsibilityCode&gt;&lt;/AdditionalInformation&gt;&lt;/Amendment&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;B13&lt;/ItemCode&gt;&lt;PreviousContent/&gt;&lt;AfterContent&gt;01&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;D04&lt;/ItemCode&gt;&lt;PreviousContent&gt;244.390&lt;/PreviousContent&gt;&lt;AfterContent&gt;3200.150&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;D06&lt;/ItemCode&gt;&lt;PreviousContent&gt;16590.920&lt;/PreviousContent&gt;&lt;AfterContent&gt;19546.680&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;D11&lt;/ItemCode&gt;&lt;PreviousContent&gt;2083.810&lt;/PreviousContent&gt;&lt;AfterContent&gt;2455.060&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CustomsValuation&gt;&lt;CommonInformation&gt;&lt;ID&gt;1&lt;/ID&gt;&lt;ItemCode&gt;N19&lt;/ItemCode&gt;&lt;PreviousContent/&gt;&lt;AfterContent&gt;CO&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ID&gt;1&lt;/ID&gt;&lt;ItemCode&gt;S01&lt;/ItemCode&gt;&lt;PreviousContent&gt;16590.920&lt;/PreviousContent&gt;&lt;AfterContent&gt;19546.680&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ID&gt;1&lt;/ID&gt;&lt;ItemCode&gt;S05&lt;/ItemCode&gt;&lt;PreviousContent&gt;244.390&lt;/PreviousContent&gt;&lt;AfterContent&gt;3200.150&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;/CustomsValuation&gt;&lt;ItemInformation&gt;&lt;SequenceNumeric&gt;1&lt;/SequenceNumeric&gt;&lt;ItemCode&gt;H31&lt;/ItemCode&gt;&lt;PreviousContent&gt;16590.920&lt;/PreviousContent&gt;&lt;AfterContent&gt;19546.680&lt;/AfterContent&gt;&lt;/ItemInformation&gt;&lt;ItemInformation&gt;&lt;SequenceNumeric&gt;1&lt;/SequenceNumeric&gt;&lt;ItemCode&gt;H32&lt;/ItemCode&gt;&lt;PreviousContent&gt;3.292&lt;/PreviousContent&gt;&lt;AfterContent&gt;3.878&lt;/AfterContent&gt;&lt;/ItemInformation&gt;&lt;ValuationAdjustment&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;SequenceNumeric&gt;2&lt;/SequenceNumeric&gt;&lt;ItemCode&gt;J02&lt;/ItemCode&gt;&lt;PreviousContent&gt;Insert&lt;/PreviousContent&gt;&lt;AfterContent&gt;07&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;SequenceNumeric&gt;2&lt;/SequenceNumeric&gt;&lt;ItemCode&gt;J03&lt;/ItemCode&gt;&lt;PreviousContent&gt;Insert&lt;/PreviousContent&gt;&lt;AfterContent&gt;2955.76&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;/ValuationAdjustment&gt;&lt;DutyTaxFee&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;E02&lt;/ItemCode&gt;&lt;TypeCode&gt;01&lt;/TypeCode&gt;&lt;PreviousContent&gt;3318.180&lt;/PreviousContent&gt;&lt;AfterContent&gt;3909.340&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;E02&lt;/ItemCode&gt;&lt;TypeCode&gt;04&lt;/TypeCode&gt;&lt;PreviousContent&gt;82.950&lt;/PreviousContent&gt;&lt;AfterContent&gt;97.730&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;E02&lt;/ItemCode&gt;&lt;TypeCode&gt;07&lt;/TypeCode&gt;&lt;PreviousContent&gt;2399.050&lt;/PreviousContent&gt;&lt;AfterContent&gt;2826.450&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;E03&lt;/ItemCode&gt;&lt;TypeCode&gt;01&lt;/TypeCode&gt;&lt;PreviousContent&gt;3318.180&lt;/PreviousContent&gt;&lt;AfterContent&gt;3909.340&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemCode&gt;E03&lt;/ItemCode&gt;&lt;TypeCode&gt;07&lt;/TypeCode&gt;&lt;PreviousContent&gt;398.190&lt;/PreviousContent&gt;&lt;AfterContent&gt;469.120&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;/DutyTaxFee&gt;&lt;ItemDutyTaxFee&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;ItemCode&gt;K03&lt;/ItemCode&gt;&lt;TypeCode&gt;01&lt;/TypeCode&gt;&lt;PreviousContent&gt;3318.180&lt;/PreviousContent&gt;&lt;AfterContent&gt;3909.340&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;ItemCode&gt;K03&lt;/ItemCode&gt;&lt;TypeCode&gt;04&lt;/TypeCode&gt;&lt;PreviousContent&gt;82.950&lt;/PreviousContent&gt;&lt;AfterContent&gt;97.730&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;ItemCode&gt;K03&lt;/ItemCode&gt;&lt;TypeCode&gt;07&lt;/TypeCode&gt;&lt;PreviousContent&gt;2399.050&lt;/PreviousContent&gt;&lt;AfterContent&gt;2826.450&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;ItemCode&gt;K04&lt;/ItemCode&gt;&lt;TypeCode&gt;01&lt;/TypeCode&gt;&lt;PreviousContent&gt;3318.180&lt;/PreviousContent&gt;&lt;AfterContent&gt;3909.340&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;CommonInformation&gt;&lt;ItemSequenceNumeric&gt;1&lt;/ItemSequenceNumeric&gt;&lt;ItemCode&gt;K04&lt;/ItemCode&gt;&lt;TypeCode&gt;07&lt;/TypeCode&gt;&lt;PreviousContent&gt;398.190&lt;/PreviousContent&gt;&lt;AfterContent&gt;469.120&lt;/AfterContent&gt;&lt;/CommonInformation&gt;&lt;/ItemDutyTaxFee&gt;&lt;/Declaration&gt;&lt;/DocumentMetadata&gt;</arg0></tns:sendImportDespachoRADI></SOAP-ENV:Body></SOAP-ENV:Envelope>